# Сообщения статусов
greet_status = "Привет! Я VKinder, бот для поиска интересных людей." \
               " Введите информацию о том, кого вы ищете, следуя инструкциям."

greet_again = "Хочешь снова найти половинку? Давай заново!"
process_age = "Введите возраст (например, 25, 30, 35, 40, 45):"

process_gender = "Введите пол (1 - женщина, 2 - мужчина):"

process_city = "Введите ID города (например, 1 для Москвы, 2 для Санкт-Петербурга," \
               " 99 для Краснодара, 158 для Владивостока, 110 для Самары):"

process_status = "Введите семейное положение (1 - не женат/не замужем, 2 - встречается," \
                 " 3 - помолвлен/помолвлена, 4 - женат/замужем, 5 - всё сложно):"

final_status = 'Привел пользователей, которые могут тебя заинтересовать!\nПиши еще для выдачи анкет.'

# Ошибки
session_error = "К сожалению, не удалось получить сессию ВКонтакте. Пожалуйста, предоставьте токен доступа."

incorrect_data = "Введены некорректные данные. Пожалуйста, повторите ввод."

some_error = "Произошла ошибка. Пожалуйста, начните сначала."
